# masw-yolo-afpn-only.yaml
#
# مرحله ۱ از برنامهٔ آزمایش: فقط AFPN روی مدل baseline، بدون MSCA.
# دقیقاً همان backbone استاندارد yolov8n + neck با AFPN (شکل ۱ مقاله، منهای بلوک MSCA).
# نتیجهٔ این آزمایش با baseline (exp0) مقایسه می‌شود تا سهم خالص AFPN مشخص شود.
#
# در مرحلهٔ بعد (وقتی AFPN تنها تست و مستند شد)، از masw-yolo-afpn.yaml
# (که MSCA را هم دارد) برای آزمایش ترکیبی استفاده کن.

nc: 10
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0
  - [-1, 1, Conv, [128, 3, 2]]     # 1
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3
  - [-1, 6, C2f, [256, True]]      # 4  <- P3
  - [-1, 1, Conv, [512, 3, 2]]     # 5
  - [-1, 6, C2f, [512, True]]      # 6  <- P4
  - [-1, 1, Conv, [1024, 3, 2]]    # 7
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9  <- P5 (بدون MSCA، مستقیم از SPPF استفاده می‌شود)

head:
  # --- یکسان‌سازی کانال قبل از ASFF ---
  - [4, 1, Conv, [64, 1, 1]]           # 10  از P3 (لایه ۴) -> ۶۴ کانال
  - [6, 1, Conv, [64, 1, 1]]           # 11  از P4 (لایه ۶) -> ۶۴ کانال

  # --- ادغام تطبیقی سطح-۲ (ASFF2) ---
  - [[10, 11], 1, ASFF2, [64, 0]]      # 12  خروجی در رزولوشن P3
  - [[10, 11], 1, ASFF2, [64, 1]]      # 13  خروجی در رزولوشن P4

  - [12, 3, C2f, [256]]                # 14  شاخه P3
  - [13, 3, C2f, [512]]                # 15  شاخه P4

  # --- یکسان‌سازی کانال P5 (مستقیم از SPPF، چون MSCA در این مرحله نیست) ---
  - [9, 1, Conv, [64, 1, 1]]           # 16  از SPPF (لایه ۹، P5) -> ۶۴ کانال

  # --- ادغام تطبیقی سطح-۳ (ASFF3) ---
  - [[14, 15, 16], 1, ASFF3, [64, 0]]  # 17  خروجی در رزولوشن P3
  - [[14, 15, 16], 1, ASFF3, [64, 1]]  # 18  خروجی در رزولوشن P4
  - [[14, 15, 16], 1, ASFF3, [64, 2]]  # 19  خروجی در رزولوشن P5

  - [17, 3, C2f, [256]]                # 20  (P3/small)
  - [18, 3, C2f, [512]]                # 21  (P4/medium)
  - [19, 3, C2f, [1024]]               # 22  (P5/large)

  - [[20, 21, 22], 1, Detect, [nc]]
