# masw-yolo-afpn.yaml


nc: 10
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0
  - [-1, 1, Conv, [128, 3, 2]]     # 1
  - [-1, 3, C2f, [128, True]]      # 2  <- C2  (stride 4,  160x160)
  - [-1, 1, Conv, [256, 3, 2]]     # 3
  - [-1, 6, C2f, [256, True]]      # 4  <- C3  (stride 8,   80x80)
  - [-1, 1, Conv, [512, 3, 2]]     # 5
  - [-1, 6, C2f, [512, True]]      # 6  <- C4  (stride 16,  40x40)
  - [-1, 1, Conv, [1024, 3, 2]]    # 7
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9  <- C5 خام (stride 32, 20x20)
  - [-1, 1, MSCA, [1024]]          # 10 <- C5 پالایش‌شده با توجه چندمقیاسی

head:
  - [[2, 4, 6, 10], 1, AFPN, [32]] # 11 

  - [11, 1, Index, [0]]            # 12  P2  (32ch, 160x160)
  - [11, 1, Index, [1]]            # 13  P3  (32ch,  80x80)
  - [11, 1, Index, [2]]            # 14  P4  (32ch,  40x40)
  - [11, 1, Index, [3]]            # 15  P5  (32ch,  20x20)

  - [12, 1, C2f, [128]]            # 16  P2 refine 
  - [13, 1, C2f, [256]]            # 17  P3 refine
  - [14, 1, C2f, [512]]            # 18  P4 refine
  - [15, 1, C2f, [512]]            # 19  P5 refine
  - [[17, 18, 19], 1, Detect, [nc]]
