# masw-yolo-afpn.yaml
#
# معماری کامل MASW-YOLO (بدون Soft-NMS و WIoU که در نمونه‌گیری/لاس اعمال می‌شوند نه در ساختار مدل)
# طبق شکل ۱ مقاله: backbone استاندارد + MSCA در انتهای backbone + AFPN (ASFF2 + ASFF3) در neck

nc: 10
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0
  - [-1, 1, Conv, [128, 3, 2]]     # 1
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3
  - [-1, 6, C2f, [256, True]]      # 4  <- P3 (اسکیل کوچک، رزولوشن بالا)
  - [-1, 1, Conv, [512, 3, 2]]     # 5
  - [-1, 6, C2f, [512, True]]      # 6  <- P4 (اسکیل متوسط)
  - [-1, 1, Conv, [1024, 3, 2]]    # 7
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9  <- P5 (اسکیل بزرگ، رزولوشن پایین)
  - [-1, 1, MSCA, [256]]           # 10 <- خروجی MSCA روی P5 (طبق شکل ۱، لایه MSCA بعد از SPPF)

head:
  # --- یکسان‌سازی کانال قبل از ASFF (طبق شکل ۱: Conv 11 و Conv 12) ---
  - [4, 1, Conv, [64, 1, 1]]           # 11  از P3 (لایه ۴) -> ۶۴ کانال
  - [6, 1, Conv, [64, 1, 1]]           # 12  از P4 (لایه ۶) -> ۶۴ کانال

  # --- ادغام تطبیقی سطح-۲ (ASFF2) ---
  # args = [c_out, level] ؛ level=0 یعنی خروجی در رزولوشن ورودی اول (11 = P3)
  - [[11, 12], 1, ASFF2, [64, 0]]      # 13  خروجی در رزولوشن P3
  - [[11, 12], 1, ASFF2, [64, 1]]      # 14  خروجی در رزولوشن P4

  - [13, 3, C2f, [256]]                # 15  شاخه P3 (کانال واقعی ۶۴)
  - [14, 3, C2f, [512]]                # 16  شاخه P4 (کانال واقعی ۱۲۸)

  # --- یکسان‌سازی کانال MSCA برای ورود به ASFF3 (طبق شکل ۱: Conv 17) ---
  - [10, 1, Conv, [64, 1, 1]]          # 17  از MSCA (لایه ۱۰، P5) -> ۶۴ کانال

  # --- ادغام تطبیقی سطح-۳ (ASFF3)، ورودی مشترک [15, 16, 17] برای هر سه سطح ---
  - [[15, 16, 17], 1, ASFF3, [64, 0]]  # 18  خروجی در رزولوشن P3 (رزولوشن لایه 15)
  - [[15, 16, 17], 1, ASFF3, [64, 1]]  # 19  خروجی در رزولوشن P4 (رزولوشن لایه 16)
  - [[15, 16, 17], 1, ASFF3, [64, 2]]  # 20  خروجی در رزولوشن P5 (رزولوشن لایه 17)

  - [18, 3, C2f, [256]]                # 21  (P3/small)
  - [19, 3, C2f, [512]]                # 22  (P4/medium)
  - [20, 3, C2f, [1024]]               # 23  (P5/large)

  - [[21, 22, 23], 1, Detect, [nc]]
