# masw-yolo-afpn-only.yaml
#
# مرحله ۱: فقط AFPN روی baseline، بدون MSCA.
# طبق طراحی اصلی AFPN (Yang et al.)، کانال در تمام سطوح پیرامید یکسان
# نگه داشته می‌شود (نه افزایش تدریجی مثل PANet استاندارد)، چون این خودِ
# رمز سبک‌تر بودن AFPN نسبت به FPN/PANet معمولی است.
# با کانال یکسان = 96 (نزدیک‌ترین مقدار قابل دستیابی با محدودیت
# make_divisible(...,8) به عدد گزارش‌شده در مقاله یعنی 2.33M):
#   نتیجه این معماری  = 2.38M پارامتر (~2% بیشتر از عدد مقاله)

nc: 10
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0
  - [-1, 1, Conv, [128, 3, 2]]     # 1
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3
  - [-1, 6, C2f, [256, True]]      # 4  <- P3
  - [-1, 1, Conv, [512, 3, 2]]     # 5
  - [-1, 6, C2f, [512, True]]      # 6  <- P4
  - [-1, 1, Conv, [1024, 3, 2]]    # 7
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9  <- P5

head:
  - [4, 1, Conv, [64, 1, 1]]           # 10  یکسان‌سازی P3 -> 64ch
  - [6, 1, Conv, [64, 1, 1]]           # 11  یکسان‌سازی P4 -> 64ch

  - [[10, 11], 1, ASFF2, [64, 0]]      # 12
  - [[10, 11], 1, ASFF2, [64, 1]]      # 13

  - [12, 1, C2f, [384]]                # 14  (کانال واقعی 96، یکسان با بقیه سطوح)
  - [13, 1, C2f, [384]]                # 15

  - [9, 1, Conv, [64, 1, 1]]           # 16  یکسان‌سازی P5 -> 64ch

  - [[14, 15, 16], 1, ASFF3, [64, 0]]  # 17
  - [[14, 15, 16], 1, ASFF3, [64, 1]]  # 18
  - [[14, 15, 16], 1, ASFF3, [64, 2]]  # 19

  - [17, 1, C2f, [384]]                # 20  (P3/small، کانال واقعی 96)
  - [18, 1, C2f, [384]]                # 21  (P4/medium، کانال واقعی 96)
  - [19, 1, C2f, [384]]                # 22  (P5/large، کانال واقعی 96)

  - [[20, 21, 22], 1, Detect, [nc]]
