nc: 10
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]      # P3
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]      # P4
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]       # P5

head:
  # یکسان‌سازی کانال P3 و P4 به ۶۴
  - [4, 1, Conv, [64, 1, 1]]        # 10  ← P3 (64)
  - [6, 1, Conv, [64, 1, 1]]        # 11  ← P4 (64)

  # ASFF2: ادغام P3 و P4 (فقط دو آرگومان: c_out و level)
  - [[10, 11], 1, ASFF2, [64, 0]]   # 12  خروجی P3
  - [[10, 11], 1, ASFF2, [64, 1]]   # 13  خروجی P4

  # BasicBlock برای هر سطح (c1 از قبل مشخص است، فقط c2 را می‌دهیم)
  - [12, 1, BasicBlock, [64]]        # 14
  - [13, 1, BasicBlock, [64]]        # 15

  # یکسان‌سازی کانال P5 به ۶۴
  - [9, 1, Conv, [64, 1, 1]]         # 16  ← P5

  # ASFF3: ادغام سه سطح (c_out و level)
  - [[14, 15, 16], 1, ASFF3, [64, 0]]   # 17  خروجی P3
  - [[14, 15, 16], 1, ASFF3, [64, 1]]   # 18  خروجی P4
  - [[14, 15, 16], 1, ASFF3, [64, 2]]   # 19  خروجی P5

  # BasicBlock نهایی
  - [17, 1, BasicBlock, [64]]        # 20
  - [18, 1, BasicBlock, [64]]        # 21
  - [19, 1, BasicBlock, [64]]        # 22

  - [[20, 21, 22], 1, Detect, [nc]]  # 23
