# masw-yolo-afpn-only.yaml
#
# نسخهٔ اصلاح‌شده: پیاده‌سازی مو‌به‌مو شکل ۳ مقاله.
# سه تفاوت نسخهٔ قبلی نسبت به شکل ۳ در این فایل رفع شده:
#   1) BasicBlock واقعاً استفاده می‌شود (داخل کلاس AFPN، بعد از هر ASFF).
#   2) هر چهار سطح C2/C3/C4/C5 وارد AFPN می‌شوند (نه فقط سه سطح).
#   3) fusion به‌صورت تدریجی/مجانبی سه‌مرحله‌ای انجام می‌شود:
#        Stage1: C2+C3 (ASFF2) -> Stage2: +C4 (ASFF3) -> Stage3: +C5 (ASFF4)
#      نه یک ASFF2 و بلافاصله یک ASFF3 مستقل از هم.
#
# نکتهٔ مهم دربارهٔ FLOPs: شکل ۳ چهار سر "Predict" (P2..P5) نشان می‌دهد.
# افزودن سر تشخیص در رزولوشن P2 (160x160 در ورودی 640) هزینهٔ محاسباتی
# قابل‌توجهی دارد و به‌احتمال زیاد دلیل اصلی آن است که FLOPs گزارش‌شده در
# جدول ۲ (~7.1-7.2G) به مدل سه‌سر (P3/P4/P5) معمول YOLOv8 نزدیک‌تر است تا
# یک مدل واقعی چهارسر. دو حالت را در پایین فایل به‌صورت کامنت مشخص کرده‌ام:
#   (الف) نسخهٔ وفادار به شکل ۳: چهار سر تشخیص (P2,P3,P4,P5)
#   (ب) نسخهٔ هم‌هزینه با جدول ۲: فقط سه سر (P3,P4,P5) — P2 فقط به‌عنوان
#       ورودی داخلی AFPN مصرف می‌شود ولی مستقیماً پیش‌بینی نمی‌کند.
# پیش‌فرض این فایل حالت (ب) است چون نتایج عددی را با جدول ۲ قابل‌مقایسه
# نگه می‌دارد؛ برای حالت (الف) فقط خط Detect در انتها را با نسخهٔ
# کامنت‌شدهٔ بالای آن جایگزین کنید.

nc: 10
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0
  - [-1, 1, Conv, [128, 3, 2]]     # 1
  - [-1, 3, C2f, [128, True]]      # 2  <- C2  (stride 4,  160x160)
  - [-1, 1, Conv, [256, 3, 2]]     # 3
  - [-1, 6, C2f, [256, True]]      # 4  <- C3  (stride 8,   80x80)
  - [-1, 1, Conv, [512, 3, 2]]     # 5
  - [-1, 6, C2f, [512, True]]      # 6  <- C4  (stride 16,  40x40)
  - [-1, 1, Conv, [1024, 3, 2]]    # 7
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9  <- C5  (stride 32,  20x20)

head:
  # ---- AFPN: fusion تدریجی سه‌مرحله‌ای طبق شکل 3 ----
  - [[2, 4, 6, 9], 1, AFPN, [64]]  # 10  عرض داخلی fusion = 64 کانال
                                    #     خروجی: لیست [P2, P3, P4, P5] هرکدام 64ch

  # ---- استخراج هر سطح از خروجی چندتایی AFPN ----
  - [10, 1, Index, [0]]            # 11  P2  (64ch, 160x160)
  - [10, 1, Index, [1]]            # 12  P3  (64ch,  80x80)
  - [10, 1, Index, [2]]            # 13  P4  (64ch,  40x40)
  - [10, 1, Index, [3]]            # 14  P5  (64ch,  20x20)

  # ---- پالایش نهایی هر سطح قبل از Detect (عرض واقعی افزایش می‌یابد) ----
  - [11, 1, C2f, [128]]            # 15  P2 refine   (فقط اگر سر P2 فعال شود لازم است)
  - [12, 1, C2f, [256]]            # 16  P3 refine
  - [13, 1, C2f, [512]]            # 17  P4 refine
  - [14, 1, C2f, [512]]            # 18  P5 refine

  # (الف) نسخهٔ وفادار به شکل 3 - چهار سر تشخیص:
  # - [[15, 16, 17, 18], 1, Detect, [nc]]

  # (ب) نسخهٔ هم‌هزینه با جدول 2 - سه سر تشخیص (P3/P4/P5)، پیش‌فرض فعال:
  - [[16, 17, 18], 1, Detect, [nc]]
