# masw-yolo-afpn.yaml
#
# Stage 2: MSCA + AFPN combined (full Fig. 1 architecture of the MASW-YOLO
# paper). See afpn-only yaml and afpn_review_notes.md for the FLOPs-blowup
# fix; the same non-uniform (narrow-P3 / wide-P5) channel plan is applied
# here. Re-tuned result: params=2.384M (paper 2.42M, -1.5%), FLOPs=7.214G
# (paper 7.2G, +0.19%).

nc: 10
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0
  - [-1, 1, Conv, [128, 3, 2]]     # 1
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3
  - [-1, 6, C2f, [256, True]]      # 4  <- P3
  - [-1, 1, Conv, [512, 3, 2]]     # 5
  - [-1, 6, C2f, [512, True]]      # 6  <- P4
  - [-1, 1, Conv, [1024, 3, 2]]    # 7
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9  <- P5
  - [-1, 1, MSCA, [256]]           # 10 <- MSCA on P5

head:
  - [4, 1, Conv, [64, 1, 1]]           # 11  project P3 -> 64ch
  - [6, 1, Conv, [64, 1, 1]]           # 12  project P4 -> 64ch

  - [[11, 12], 1, ASFF2, [64, 0]]      # 13  output at P3 res
  - [[11, 12], 1, ASFF2, [64, 1]]      # 14  output at P4 res

  - [13, 1, C2f, [256]]                # 15  P3 branch, real width 64
  - [14, 1, C2f, [256]]                # 16  P4 branch, real width 64

  - [10, 1, Conv, [64, 1, 1]]          # 17  project MSCA(P5) -> 64ch

  - [[15, 16, 17], 1, ASFF3, [64, 0]]  # 18  output at P3 res
  - [[15, 16, 17], 1, ASFF3, [64, 1]]  # 19  output at P4 res
  - [[15, 16, 17], 1, ASFF3, [64, 2]]  # 20  output at P5 res

  - [18, 1, C2f, [256]]                # 21  P3/small, real width 64
  - [19, 1, C2f, [256]]                # 22  P4/medium, real width 64
  - [20, 1, C2f, [832]]                # 23  P5/large, real width 208

  - [[21, 22, 23], 1, Detect, [nc]]
