# masw-yolo-afpn.yaml
#
# مرحله ۲: ترکیب MSCA + AFPN (طبق شکل ۱ کامل مقاله MASW-YOLO).
# با تنظیم دقیق کانال‌های C2f بعد از ASFF (352/384)، پارامتر نهایی به
# 2.414M رسید که تقریباً دقیقاً با عدد گزارش‌شده در مقاله (2.42M) یکی است.

nc: 10
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0
  - [-1, 1, Conv, [128, 3, 2]]     # 1
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3
  - [-1, 6, C2f, [256, True]]      # 4  <- P3
  - [-1, 1, Conv, [512, 3, 2]]     # 5
  - [-1, 6, C2f, [512, True]]      # 6  <- P4
  - [-1, 1, Conv, [1024, 3, 2]]    # 7
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9  <- P5
  - [-1, 1, MSCA, [256]]           # 10 <- خروجی MSCA روی P5

head:
  - [4, 1, Conv, [64, 1, 1]]           # 11  یکسان‌سازی P3 -> 64ch
  - [6, 1, Conv, [64, 1, 1]]           # 12  یکسان‌سازی P4 -> 64ch

  - [[11, 12], 1, ASFF2, [64, 0]]      # 13
  - [[11, 12], 1, ASFF2, [64, 1]]      # 14

  - [13, 1, C2f, [352]]                # 15  (کانال واقعی 88)
  - [14, 1, C2f, [352]]                # 16

  - [10, 1, Conv, [64, 1, 1]]          # 17  یکسان‌سازی خروجی MSCA (P5) -> 64ch

  - [[15, 16, 17], 1, ASFF3, [64, 0]]  # 18
  - [[15, 16, 17], 1, ASFF3, [64, 1]]  # 19
  - [[15, 16, 17], 1, ASFF3, [64, 2]]  # 20

  - [18, 1, C2f, [384]]                # 21  (P3/small، کانال واقعی 96)
  - [19, 1, C2f, [352]]                # 22  (P4/medium، کانال واقعی 88)
  - [20, 1, C2f, [352]]                # 23  (P5/large، کانال واقعی 88)

  - [[21, 22, 23], 1, Detect, [nc]]
